In [26]:
import pandas as pd
import numpy as np

# Basic Operations

In [27]:
3+4

7

In [28]:
'8'+'a'

'8a'

In [29]:
4*5

20

In [30]:
9000//4

2250

# List

In [31]:
list=[1,2,3,4,5]

In [32]:
list

[1, 2, 3, 4, 5]

In [34]:
b=(1,2,3,4,5)

In [35]:
b

(1, 2, 3, 4, 5)

In [36]:
marks = [10, 20, 30, 50, 75, 90, 95]
pass_mark = 50
marks[0]<pass_mark

True

# Conditional and looping statement

In [37]:
if marks[0]<pass_mark:
    print("fail")

fail

In [38]:
for i in range(len(marks)):
    print(marks[i])

10
20
30
50
75
90
95

In [39]:
for mark in marks:
    print(mark)  
    if mark<pass_mark:
        print("fail")
    else: 
        print("pass")
    print("**************\n")

10
fail
**************

20
fail
**************

30
fail
**************

50
pass
**************

75
pass
**************

90
pass
**************

95
pass
**************

# Range Function

In [40]:
range(15)

range(0, 15)

In [41]:
w = range(2, 20, 4)
for n in w:
    print(n)

2
6
10
14
18

# Functions

In [42]:
def foo_sum(a, b):
    return a+b
foo_sum(1, 2)

3

In [43]:
def foo_diff(num1 = 0, num2 = 0):
    print(num1)
    return num1-num2
foo_diff(num1 = 10, num2 = 3)

10

7

In [44]:
foo_diff(17)

17

17

In [45]:
import pandas as pd
import numpy as np

# Pandas Series

In [46]:
marks

[10, 20, 30, 50, 75, 90, 95]

In [47]:
mark = pd.Series(marks)

In [48]:
mark

0    10
1    20
2    30
3    50
4    75
5    90
6    95
dtype: int64

In [49]:
mark.index

RangeIndex(start=0, stop=7, step=1)

In [50]:
mark.values

array([10, 20, 30, 50, 75, 90, 95], dtype=int64)

In [51]:
mark[4:]

4    75
5    90
6    95
dtype: int64

In [52]:
mark[:4]

0    10
1    20
2    30
3    50
dtype: int64

In [53]:
mark[:]

0    10
1    20
2    30
3    50
4    75
5    90
6    95
dtype: int64

In [54]:
mark[4]=None

In [55]:
mark[:]

0    10.0
1    20.0
2    30.0
3    50.0
4     NaN
5    90.0
6    95.0
dtype: float64

In [56]:
mark.value_counts()

30.0    1
20.0    1
10.0    1
50.0    1
90.0    1
95.0    1
dtype: int64

# Data Loading

In [57]:
df = pd.read_csv("C:/Users/124ab/data.csv")

In [58]:
df

          Y        X  D
0   41.0890   5.3864  0
1   46.0000   8.7179  0
2   43.7821       11  0
3   42.0000       12  0
4   44.9359       17  0
..      ...      ... ..
73  36.8590  23.0769  1
74  35.7051  18.9744  1
75  32.6282  17.1795  1
76  31.8590  11.0256  1
77  29.1661  14.6154  1

[78 rows x 3 columns]

In [59]:
df.head()

         Y       X  D
0  41.0890  5.3864  0
1  46.0000  8.7179  0
2  43.7821      11  0
3  42.0000      12  0
4  44.9359      17  0

In [60]:
df.tail()

          Y        X  D
73  36.8590  23.0769  1
74  35.7051  18.9744  1
75  32.6282  17.1795  1
76  31.8590  11.0256  1
77  29.1661  14.6154  1

In [61]:
df.index

RangeIndex(start=0, stop=78, step=1)

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Y       78 non-null     float64
 1   X       78 non-null     object
 2   D       78 non-null     int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.0+ KB

In [63]:
df.dtypes

Y    float64
X     object
D      int64
dtype: object

In [64]:
df.shape

(78, 3)

In [65]:
df.isna()

        Y      X      D
0   False  False  False
1   False  False  False
2   False  False  False
3   False  False  False
4   False  False  False
..    ...    ...    ...
73  False  False  False
74  False  False  False
75  False  False  False
76  False  False  False
77  False  False  False

[78 rows x 3 columns]

In [66]:
df.isna().sum()

Y    0
X    0
D    0
dtype: int64

In [67]:
df.corr()

          Y         D
Y  1.000000 -0.375743
D -0.375743  1.000000

In [68]:
df.describe()

               Y          D
count  78.000000  78.000000
mean   57.129519   0.512821
std    15.159175   0.503071
min    29.000000   0.000000
25%    45.778825   0.000000
50%    56.089700   1.000000
75%    68.301250   1.000000
max    88.397400   1.000000